{
  "transform_params" : {
    "image" : {
      "bias_a" : 0,
      "bias_g" : -0.5,
      "bias_r" : -0.5,
      "bias_b" : -0.5,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0039215688593685627
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv1_relu_output",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "image",
      "weights" : {
        "W_U8" : 3,
        "per_ch_qscale" : 7,
        "per_ch_qbias" : 5
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_1_relu_output",
      "K" : 16,
      "blob_biases" : 9,
      "name" : "conv_dw_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "conv1_relu_output",
      "weights" : {
        "W_U8" : 11,
        "per_ch_qscale" : 15,
        "per_ch_qbias" : 13
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_1_relu_output",
      "K" : 16,
      "blob_biases" : 17,
      "name" : "conv_pw_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv_dw_1_relu_output",
      "weights" : {
        "W_U8" : 19,
        "per_ch_qscale" : 23,
        "per_ch_qbias" : 21
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_2_relu_output",
      "K" : 32,
      "blob_biases" : 25,
      "stride_x" : 2,
      "name" : "conv_dw_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv_pw_1_relu_output",
      "weights" : {
        "W_U8" : 27,
        "per_ch_qscale" : 31,
        "per_ch_qbias" : 29
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_2_relu_output",
      "K" : 32,
      "blob_biases" : 33,
      "name" : "conv_pw_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_dw_2_relu_output",
      "weights" : {
        "W_U8" : 35,
        "per_ch_qscale" : 39,
        "per_ch_qbias" : 37
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_3_relu_output",
      "K" : 64,
      "blob_biases" : 41,
      "name" : "conv_dw_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_pw_2_relu_output",
      "weights" : {
        "W_U8" : 43,
        "per_ch_qscale" : 47,
        "per_ch_qbias" : 45
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_3_relu_output",
      "K" : 64,
      "blob_biases" : 49,
      "name" : "conv_pw_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_dw_3_relu_output",
      "weights" : {
        "W_U8" : 51,
        "per_ch_qscale" : 55,
        "per_ch_qbias" : 53
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_4_relu_output",
      "K" : 64,
      "blob_biases" : 57,
      "stride_x" : 2,
      "name" : "conv_dw_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_pw_3_relu_output",
      "weights" : {
        "W_U8" : 59,
        "per_ch_qscale" : 63,
        "per_ch_qbias" : 61
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_4_relu_output",
      "K" : 64,
      "blob_biases" : 65,
      "name" : "conv_pw_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_dw_4_relu_output",
      "weights" : {
        "W_U8" : 67,
        "per_ch_qscale" : 71,
        "per_ch_qbias" : 69
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_5_relu_output",
      "K" : 128,
      "blob_biases" : 73,
      "name" : "conv_dw_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_pw_4_relu_output",
      "weights" : {
        "W_U8" : 75,
        "per_ch_qscale" : 79,
        "per_ch_qbias" : 77
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_5_relu_output",
      "K" : 128,
      "blob_biases" : 81,
      "name" : "conv_pw_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_dw_5_relu_output",
      "weights" : {
        "W_U8" : 83,
        "per_ch_qscale" : 87,
        "per_ch_qbias" : 85
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_6_relu_output",
      "K" : 128,
      "blob_biases" : 89,
      "stride_x" : 2,
      "name" : "conv_dw_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_pw_5_relu_output",
      "weights" : {
        "W_U8" : 91,
        "per_ch_qscale" : 95,
        "per_ch_qbias" : 93
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_6_relu_output",
      "K" : 128,
      "blob_biases" : 97,
      "name" : "conv_pw_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_dw_6_relu_output",
      "weights" : {
        "W_U8" : 99,
        "per_ch_qscale" : 103,
        "per_ch_qbias" : 101
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_7_relu_output",
      "K" : 256,
      "blob_biases" : 105,
      "name" : "conv_dw_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_6_relu_output",
      "weights" : {
        "W_U8" : 107,
        "per_ch_qscale" : 111,
        "per_ch_qbias" : 109
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_7_relu_output",
      "K" : 256,
      "blob_biases" : 113,
      "name" : "conv_pw_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_dw_7_relu_output",
      "weights" : {
        "W_U8" : 115,
        "per_ch_qscale" : 119,
        "per_ch_qbias" : 117
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_8_relu_output",
      "K" : 256,
      "blob_biases" : 121,
      "name" : "conv_dw_8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_7_relu_output",
      "weights" : {
        "W_U8" : 123,
        "per_ch_qscale" : 127,
        "per_ch_qbias" : 125
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_8_relu_output",
      "K" : 256,
      "blob_biases" : 129,
      "name" : "conv_pw_8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_dw_8_relu_output",
      "weights" : {
        "W_U8" : 131,
        "per_ch_qscale" : 135,
        "per_ch_qbias" : 133
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_9_relu_output",
      "K" : 256,
      "blob_biases" : 137,
      "name" : "conv_dw_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_8_relu_output",
      "weights" : {
        "W_U8" : 139,
        "per_ch_qscale" : 143,
        "per_ch_qbias" : 141
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_9_relu_output",
      "K" : 256,
      "blob_biases" : 145,
      "name" : "conv_pw_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_dw_9_relu_output",
      "weights" : {
        "W_U8" : 147,
        "per_ch_qscale" : 151,
        "per_ch_qbias" : 149
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_10_relu_output",
      "K" : 256,
      "blob_biases" : 153,
      "name" : "conv_dw_10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_9_relu_output",
      "weights" : {
        "W_U8" : 155,
        "per_ch_qscale" : 159,
        "per_ch_qbias" : 157
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_10_relu_output",
      "K" : 256,
      "blob_biases" : 161,
      "name" : "conv_pw_10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_dw_10_relu_output",
      "weights" : {
        "W_U8" : 163,
        "per_ch_qscale" : 167,
        "per_ch_qbias" : 165
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_11_relu_output",
      "K" : 256,
      "blob_biases" : 169,
      "name" : "conv_dw_11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_10_relu_output",
      "weights" : {
        "W_U8" : 171,
        "per_ch_qscale" : 175,
        "per_ch_qbias" : 173
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_11_relu_output",
      "K" : 256,
      "blob_biases" : 177,
      "name" : "conv_pw_11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_dw_11_relu_output",
      "weights" : {
        "W_U8" : 179,
        "per_ch_qscale" : 183,
        "per_ch_qbias" : 181
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_12_relu_output",
      "K" : 256,
      "blob_biases" : 185,
      "stride_x" : 2,
      "name" : "conv_dw_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_11_relu_output",
      "weights" : {
        "W_U8" : 187,
        "per_ch_qscale" : 191,
        "per_ch_qbias" : 189
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_12_relu_output",
      "K" : 256,
      "blob_biases" : 193,
      "name" : "conv_pw_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv_dw_12_relu_output",
      "weights" : {
        "W_U8" : 195,
        "per_ch_qscale" : 199,
        "per_ch_qbias" : 197
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_13_relu_output",
      "K" : 512,
      "blob_biases" : 201,
      "name" : "conv_dw_13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv_pw_12_relu_output",
      "weights" : {
        "W_U8" : 203,
        "per_ch_qscale" : 207,
        "per_ch_qbias" : 205
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_13_relu_output",
      "K" : 512,
      "blob_biases" : 209,
      "name" : "conv_pw_13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv_dw_13_relu_output",
      "weights" : {
        "W_U8" : 211,
        "per_ch_qscale" : 215,
        "per_ch_qbias" : 213
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_pw_1_relu_output",
      "K" : 256,
      "blob_biases" : 217,
      "name" : "decoder_conv_pw_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv_pw_11_relu_output",
      "weights" : {
        "W_U8" : 219,
        "per_ch_qscale" : 223,
        "per_ch_qbias" : 221
      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv_pw_13_relu_output",
      "scaling_factor_y" : 2,
      "align_corners" : 0,
      "mode" : 0,
      "weights" : {

      },
      "top" : "decoder_upsample_1_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "decoder_upsample_1"
    },
    {
      "alpha" : 1,
      "bottom" : "decoder_upsample_1_output,decoder_conv_pw_1_relu_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "add_1_output",
      "type" : "elementwise",
      "name" : "add_1",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_dw_1_output_intermin_",
      "K" : 512,
      "name" : "decoder_conv_dw_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 512,
      "bottom" : "add_1_output",
      "weights" : {
        "W_U8" : 225,
        "per_ch_qscale" : 229,
        "per_ch_qbias" : 227
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_dw_relu_1_output",
      "K" : 512,
      "blob_biases" : 231,
      "name" : "decoder_conv_dw_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "decoder_conv_dw_1_output_intermin_",
      "weights" : {
        "W_U8" : 233,
        "per_ch_qscale" : 237,
        "per_ch_qbias" : 235
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_pw_2_relu_output",
      "K" : 128,
      "blob_biases" : 239,
      "name" : "decoder_conv_pw_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv_pw_5_relu_output",
      "weights" : {
        "W_U8" : 241,
        "per_ch_qscale" : 245,
        "per_ch_qbias" : 243
      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "decoder_conv_dw_relu_1_output",
      "scaling_factor_y" : 2,
      "align_corners" : 0,
      "mode" : 0,
      "weights" : {

      },
      "top" : "decoder_upsample_2_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "decoder_upsample_2"
    },
    {
      "alpha" : 1,
      "bottom" : "decoder_upsample_2_output,decoder_conv_pw_2_relu_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "add_2_output",
      "type" : "elementwise",
      "name" : "add_2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_dw_2_output_intermin_",
      "K" : 32,
      "name" : "decoder_conv_dw_2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "add_2_output",
      "weights" : {
        "W_U8" : 247,
        "per_ch_qscale" : 251,
        "per_ch_qbias" : 249
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_dw_relu_2_output",
      "K" : 32,
      "blob_biases" : 253,
      "name" : "decoder_conv_dw_2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "decoder_conv_dw_2_output_intermin_",
      "weights" : {
        "W_U8" : 255,
        "per_ch_qscale" : 259,
        "per_ch_qbias" : 257
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_pw_3_relu_output",
      "K" : 64,
      "blob_biases" : 261,
      "name" : "decoder_conv_pw_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv_pw_3_relu_output",
      "weights" : {
        "W_U8" : 263,
        "per_ch_qscale" : 267,
        "per_ch_qbias" : 265
      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "decoder_conv_dw_relu_2_output",
      "scaling_factor_y" : 2,
      "align_corners" : 0,
      "mode" : 0,
      "weights" : {

      },
      "top" : "decoder_upsample_3_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "decoder_upsample_3"
    },
    {
      "alpha" : 1,
      "bottom" : "decoder_upsample_3_output,decoder_conv_pw_3_relu_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "add_3_output",
      "type" : "elementwise",
      "name" : "add_3",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_dw_3_output_intermin_",
      "K" : 32,
      "name" : "decoder_conv_dw_3_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "add_3_output",
      "weights" : {
        "W_U8" : 269,
        "per_ch_qscale" : 273,
        "per_ch_qbias" : 271
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_dw_relu_3_output",
      "K" : 32,
      "blob_biases" : 275,
      "name" : "decoder_conv_dw_3_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "decoder_conv_dw_3_output_intermin_",
      "weights" : {
        "W_U8" : 277,
        "per_ch_qscale" : 281,
        "per_ch_qbias" : 279
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_pw_4_relu_output",
      "K" : 32,
      "blob_biases" : 283,
      "name" : "decoder_conv_pw_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv_pw_1_relu_output",
      "weights" : {
        "W_U8" : 285,
        "per_ch_qscale" : 289,
        "per_ch_qbias" : 287
      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "decoder_conv_dw_relu_3_output",
      "scaling_factor_y" : 2,
      "align_corners" : 0,
      "mode" : 0,
      "weights" : {

      },
      "top" : "decoder_upsample_4_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "decoder_upsample_4"
    },
    {
      "alpha" : 1,
      "bottom" : "decoder_upsample_4_output,decoder_conv_pw_4_relu_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "add_4_output",
      "type" : "elementwise",
      "name" : "add_4",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_dw_4_output_intermin_",
      "K" : 32,
      "name" : "decoder_conv_dw_4_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "add_4_output",
      "weights" : {
        "W_U8" : 291,
        "per_ch_qscale" : 295,
        "per_ch_qbias" : 293
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_dw_relu_4_output",
      "K" : 32,
      "blob_biases" : 297,
      "name" : "decoder_conv_dw_4_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "decoder_conv_dw_4_output_intermin_",
      "weights" : {
        "W_U8" : 299,
        "per_ch_qscale" : 303,
        "per_ch_qbias" : 301
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "decoder_conv_dw_relu_4_output",
      "scaling_factor_y" : 2,
      "align_corners" : 0,
      "mode" : 0,
      "weights" : {

      },
      "top" : "decoder_upsample_5_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "decoder_upsample_5"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_dw_5_output_intermin_",
      "K" : 32,
      "name" : "decoder_conv_dw_5_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "decoder_upsample_5_output",
      "weights" : {
        "W_U8" : 305,
        "per_ch_qscale" : 309,
        "per_ch_qbias" : 307
      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv_dw_relu_5_output",
      "K" : 32,
      "blob_biases" : 311,
      "name" : "decoder_conv_dw_5_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "decoder_conv_dw_5_output_intermin_",
      "weights" : {
        "W_U8" : 313,
        "per_ch_qscale" : 317,
        "per_ch_qbias" : 315
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "decoder_conv2d_1_output",
      "K" : 32,
      "blob_biases" : 319,
      "name" : "decoder_conv2d_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 2,
      "bottom" : "decoder_conv_dw_relu_5_output",
      "weights" : {
        "W_U8" : 321,
        "per_ch_qscale" : 325,
        "per_ch_qbias" : 323
      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "output",
      "type" : "softmax",
      "name" : "decoder_conv2d_1__activation__",
      "bottom" : "decoder_conv2d_1_output"
    }
  ]
}