{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/Conv\/Relu6:0",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "FeatureExtractor\/MobilenetV2\/Conv\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/Conv\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/Conv\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/Conv\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/Conv\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/Conv\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/Conv\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/Conv\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/Conv\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/Conv\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv\/depthwise\/Relu6:0",
      "blob_weights" : 7,
      "K" : 32,
      "blob_biases" : 5,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "FeatureExtractor\/MobilenetV2\/Conv\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv\/project\/BatchNorm\/batchnorm\/add_1:0",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv\/project\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/expand\/Relu6:0",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_1\/expand\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv\/project\/BatchNorm\/batchnorm\/add_1:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_1\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_1\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0",
      "blob_weights" : 19,
      "K" : 96,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_1\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_1\/expand\/Relu6:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/batchnorm\/add_1:0",
      "blob_weights" : 23,
      "K" : 96,
      "blob_biases" : 21,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/expand\/Relu6:0",
      "blob_weights" : 27,
      "K" : 24,
      "blob_biases" : 25,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/expand\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/batchnorm\/add_1:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0",
      "blob_weights" : 31,
      "K" : 144,
      "blob_biases" : 29,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/project\/BatchNorm\/batchnorm\/add_1:0",
      "blob_weights" : 35,
      "K" : 144,
      "blob_biases" : 33,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/project\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/project\/BatchNorm\/batchnorm\/add_1:0,FeatureExtractor\/MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/batchnorm\/add_1:0",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/add:0",
      "type" : "elementwise",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/expand\/Relu6:0",
      "blob_weights" : 39,
      "K" : 24,
      "blob_biases" : 37,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_3\/expand\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_2\/add:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_3\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_3\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0",
      "blob_weights" : 43,
      "K" : 144,
      "blob_biases" : 41,
      "stride_x" : 2,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_3\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_3\/expand\/Relu6:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/batchnorm\/add_1:0",
      "blob_weights" : 47,
      "K" : 144,
      "blob_biases" : 45,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/expand\/Relu6:0",
      "blob_weights" : 51,
      "K" : 32,
      "blob_biases" : 49,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/expand\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/batchnorm\/add_1:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0",
      "blob_weights" : 55,
      "K" : 192,
      "blob_biases" : 53,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/project\/BatchNorm\/batchnorm\/add_1:0",
      "blob_weights" : 59,
      "K" : 192,
      "blob_biases" : 57,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/project\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/project\/BatchNorm\/batchnorm\/add_1:0,FeatureExtractor\/MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/batchnorm\/add_1:0",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/add:0",
      "type" : "elementwise",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/expand\/Relu6:0",
      "blob_weights" : 63,
      "K" : 32,
      "blob_biases" : 61,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/expand\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_4\/add:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0",
      "blob_weights" : 67,
      "K" : 192,
      "blob_biases" : 65,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/project\/BatchNorm\/batchnorm\/add_1:0",
      "blob_weights" : 71,
      "K" : 192,
      "blob_biases" : 69,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/project\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/project\/BatchNorm\/batchnorm\/add_1:0,FeatureExtractor\/MobilenetV2\/expanded_conv_4\/add:0",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/add:0",
      "type" : "elementwise",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/expand\/Relu6:0",
      "blob_weights" : 75,
      "K" : 32,
      "blob_biases" : 73,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_6\/expand\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_5\/add:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_6\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_6\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0",
      "blob_weights" : 79,
      "K" : 192,
      "blob_biases" : 77,
      "stride_x" : 2,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_6\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_6\/expand\/Relu6:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_6\/project\/BatchNorm\/batchnorm\/add_1:0",
      "blob_weights" : 83,
      "K" : 192,
      "blob_biases" : 81,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_6\/project\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_6\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/expand\/Relu6:0",
      "blob_weights" : 87,
      "K" : 64,
      "blob_biases" : 85,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/expand\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_6\/project\/BatchNorm\/batchnorm\/add_1:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0",
      "blob_weights" : 91,
      "K" : 384,
      "blob_biases" : 89,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/project\/BatchNorm\/batchnorm\/add_1:0",
      "blob_weights" : 95,
      "K" : 384,
      "blob_biases" : 93,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/project\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/project\/BatchNorm\/batchnorm\/add_1:0,FeatureExtractor\/MobilenetV2\/expanded_conv_6\/project\/BatchNorm\/batchnorm\/add_1:0",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/add:0",
      "type" : "elementwise",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/expand\/Relu6:0",
      "blob_weights" : 99,
      "K" : 64,
      "blob_biases" : 97,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/expand\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_7\/add:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0",
      "blob_weights" : 103,
      "K" : 384,
      "blob_biases" : 101,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/project\/BatchNorm\/batchnorm\/add_1:0",
      "blob_weights" : 107,
      "K" : 384,
      "blob_biases" : 105,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/project\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/project\/BatchNorm\/batchnorm\/add_1:0,FeatureExtractor\/MobilenetV2\/expanded_conv_7\/add:0",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/add:0",
      "type" : "elementwise",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/expand\/Relu6:0",
      "blob_weights" : 111,
      "K" : 64,
      "blob_biases" : 109,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_9\/expand\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_8\/add:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/expand\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/expand\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/expand\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/expand\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/expand\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/expand\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/expand\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_9\/expand\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_9\/expand\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0",
      "blob_weights" : 115,
      "K" : 384,
      "blob_biases" : 113,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_9\/depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_9\/expand\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "FeatureExtractor\/MobilenetV2\/expanded_conv_9\/project\/BatchNorm\/batchnorm\/add_1:0",
      "blob_weights" : 119,
      "K" : 384,
      "blob_biases" : 117,
      "name" : "FeatureExtractor\/MobilenetV2\/expanded_conv_9\/project\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "FeatureExtractor\/MobilenetV2\/expanded_conv_9\/depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
