{
  "transform_params" : {
    "image" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_1_output",
      "blob_weights" : 1,
      "K" : 3,
      "name" : "conv2d_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 8,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 9,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_1",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 8,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 3,
      "bottom" : "conv2d_1_output",
      "debug_info" : "instance_normalization_1",
      "weights" : {

      },
      "top" : "instance_normalization_1_output"
    },
    {
      "bottom" : "instance_normalization_1_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_1",
      "top" : "activation_1_output",
      "type" : "activation",
      "name" : "activation_1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_2_output",
      "blob_weights" : 5,
      "K" : 8,
      "stride_x" : 2,
      "name" : "conv2d_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 16,
      "bottom" : "activation_1_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_2",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 16,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 7,
      "bottom" : "conv2d_2_output",
      "debug_info" : "instance_normalization_2",
      "weights" : {

      },
      "top" : "instance_normalization_2_output"
    },
    {
      "bottom" : "instance_normalization_2_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_2",
      "top" : "activation_2_output",
      "type" : "activation",
      "name" : "activation_2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_3_output",
      "blob_weights" : 9,
      "K" : 16,
      "stride_x" : 2,
      "name" : "conv2d_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_2_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_3",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 11,
      "bottom" : "conv2d_3_output",
      "debug_info" : "instance_normalization_3",
      "weights" : {

      },
      "top" : "instance_normalization_3_output"
    },
    {
      "bottom" : "instance_normalization_3_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_3",
      "top" : "activation_3_output",
      "type" : "activation",
      "name" : "activation_3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_4_output",
      "blob_weights" : 13,
      "K" : 32,
      "name" : "conv2d_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_3_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_4",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 15,
      "bottom" : "conv2d_4_output",
      "debug_info" : "instance_normalization_4",
      "weights" : {

      },
      "top" : "instance_normalization_4_output"
    },
    {
      "bottom" : "instance_normalization_4_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_4",
      "top" : "activation_4_output",
      "type" : "activation",
      "name" : "activation_4"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_5_output",
      "blob_weights" : 17,
      "K" : 32,
      "name" : "conv2d_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_4_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_5",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 19,
      "bottom" : "conv2d_5_output",
      "debug_info" : "instance_normalization_5",
      "weights" : {

      },
      "top" : "instance_normalization_5_output"
    },
    {
      "bottom" : "instance_normalization_5_output,activation_3_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_1",
      "top" : "add_1_output",
      "type" : "elementwise",
      "name" : "add_1",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_6_output",
      "blob_weights" : 21,
      "K" : 32,
      "name" : "conv2d_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "add_1_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_6",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 23,
      "bottom" : "conv2d_6_output",
      "debug_info" : "instance_normalization_6",
      "weights" : {

      },
      "top" : "instance_normalization_6_output"
    },
    {
      "bottom" : "instance_normalization_6_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_5",
      "top" : "activation_5_output",
      "type" : "activation",
      "name" : "activation_5"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_7_output",
      "blob_weights" : 25,
      "K" : 32,
      "name" : "conv2d_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_5_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_7",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 27,
      "bottom" : "conv2d_7_output",
      "debug_info" : "instance_normalization_7",
      "weights" : {

      },
      "top" : "instance_normalization_7_output"
    },
    {
      "bottom" : "instance_normalization_7_output,add_1_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_2",
      "top" : "add_2_output",
      "type" : "elementwise",
      "name" : "add_2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_8_output",
      "blob_weights" : 29,
      "K" : 32,
      "name" : "conv2d_8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "add_2_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_8",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 31,
      "bottom" : "conv2d_8_output",
      "debug_info" : "instance_normalization_8",
      "weights" : {

      },
      "top" : "instance_normalization_8_output"
    },
    {
      "bottom" : "instance_normalization_8_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_6",
      "top" : "activation_6_output",
      "type" : "activation",
      "name" : "activation_6"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_9",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_9_output",
      "blob_weights" : 33,
      "K" : 32,
      "name" : "conv2d_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_6_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_9",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 35,
      "bottom" : "conv2d_9_output",
      "debug_info" : "instance_normalization_9",
      "weights" : {

      },
      "top" : "instance_normalization_9_output"
    },
    {
      "bottom" : "instance_normalization_9_output,add_2_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_3",
      "top" : "add_3_output",
      "type" : "elementwise",
      "name" : "add_3",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_10",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_10_output",
      "blob_weights" : 37,
      "K" : 32,
      "name" : "conv2d_10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "add_3_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_10",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 39,
      "bottom" : "conv2d_10_output",
      "debug_info" : "instance_normalization_10",
      "weights" : {

      },
      "top" : "instance_normalization_10_output"
    },
    {
      "bottom" : "instance_normalization_10_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_7",
      "top" : "activation_7_output",
      "type" : "activation",
      "name" : "activation_7"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_11",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_11_output",
      "blob_weights" : 41,
      "K" : 32,
      "name" : "conv2d_11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_7_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_11",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 43,
      "bottom" : "conv2d_11_output",
      "debug_info" : "instance_normalization_11",
      "weights" : {

      },
      "top" : "instance_normalization_11_output"
    },
    {
      "bottom" : "instance_normalization_11_output,add_3_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_4",
      "top" : "add_4_output",
      "type" : "elementwise",
      "name" : "add_4",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_12",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_12_output",
      "blob_weights" : 45,
      "K" : 32,
      "name" : "conv2d_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "add_4_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_12",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 47,
      "bottom" : "conv2d_12_output",
      "debug_info" : "instance_normalization_12",
      "weights" : {

      },
      "top" : "instance_normalization_12_output"
    },
    {
      "bottom" : "instance_normalization_12_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_8",
      "top" : "activation_8_output",
      "type" : "activation",
      "name" : "activation_8"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_13",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_13_output",
      "blob_weights" : 49,
      "K" : 32,
      "name" : "conv2d_13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_8_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_13",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 51,
      "bottom" : "conv2d_13_output",
      "debug_info" : "instance_normalization_13",
      "weights" : {

      },
      "top" : "instance_normalization_13_output"
    },
    {
      "bottom" : "instance_normalization_13_output,add_4_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_5",
      "top" : "add_5_output",
      "type" : "elementwise",
      "name" : "add_5",
      "beta" : 0
    },
    {
      "top" : "up_sampling2d_1_output",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "add_5_output",
      "debug_info" : "up_sampling2d_1",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "up_sampling2d_1",
      "scaling_factor_y" : 2
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_14",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_14_output",
      "blob_weights" : 53,
      "K" : 32,
      "name" : "conv2d_14",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 16,
      "bottom" : "up_sampling2d_1_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_14",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 16,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 55,
      "bottom" : "conv2d_14_output",
      "debug_info" : "instance_normalization_14",
      "weights" : {

      },
      "top" : "instance_normalization_14_output"
    },
    {
      "bottom" : "instance_normalization_14_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_9",
      "top" : "activation_9_output",
      "type" : "activation",
      "name" : "activation_9"
    },
    {
      "top" : "up_sampling2d_2_output",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "activation_9_output",
      "debug_info" : "up_sampling2d_2",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "up_sampling2d_2",
      "scaling_factor_y" : 2
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_15",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_15_output",
      "blob_weights" : 57,
      "K" : 16,
      "name" : "conv2d_15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 8,
      "bottom" : "up_sampling2d_2_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_15",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 8,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 59,
      "bottom" : "conv2d_15_output",
      "debug_info" : "instance_normalization_15",
      "weights" : {

      },
      "top" : "instance_normalization_15_output"
    },
    {
      "bottom" : "instance_normalization_15_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "activation_10",
      "top" : "activation_10_output",
      "type" : "activation",
      "name" : "activation_10"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_16",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_16_output",
      "blob_weights" : 61,
      "K" : 8,
      "name" : "conv2d_16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 3,
      "bottom" : "activation_10_output",
      "weights" : {

      },
      "Nx" : 9,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "name" : "instance_normalization_16",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 0.0010000000474974513,
      "C" : 3,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 63,
      "bottom" : "conv2d_16_output",
      "debug_info" : "instance_normalization_16",
      "weights" : {

      },
      "top" : "instance_normalization_16_output"
    },
    {
      "bottom" : "instance_normalization_16_output",
      "weights" : {

      },
      "mode" : 1,
      "debug_info" : "activation_11",
      "top" : "activation_11_output",
      "type" : "activation",
      "name" : "activation_11"
    },
    {
      "bottom" : "",
      "k" : 3,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "deprocess_stylized_image_1",
      "constant_blob" : 65,
      "top" : "deprocess_stylized_image_1_constant_in_scale",
      "w" : 1,
      "type" : "load_constant",
      "name" : "deprocess_stylized_image_1_constant_in_scale"
    },
    {
      "bottom" : "",
      "k" : 3,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "deprocess_stylized_image_1",
      "constant_blob" : 67,
      "top" : "deprocess_stylized_image_1_constant_in_bias",
      "w" : 1,
      "type" : "load_constant",
      "name" : "deprocess_stylized_image_1_constant_in_bias"
    },
    {
      "bottom" : "activation_11_output,deprocess_stylized_image_1_constant_in_scale",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "deprocess_stylized_image_1",
      "top" : "deprocess_stylized_image_1_mul_out",
      "type" : "elementwise",
      "name" : "deprocess_stylized_image_1_mul_out",
      "beta" : 0
    },
    {
      "bottom" : "deprocess_stylized_image_1_mul_out,deprocess_stylized_image_1_constant_in_bias",
      "alpha" : 1,
      "operation" : 0,
      "beta" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "deprocess_stylized_image_1",
      "top" : "stylizedImage",
      "type" : "elementwise",
      "name" : "deprocess_stylized_image_1",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}